gcc -g p6final.c
 ./a.out
enter any number :1
1=1 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
 
 gcc -g p7final.c
 ./a.out
Enter a number
2
Enter the element no 0 of the array
3
Enter the element no 1 of the array
4
 
 gcc -g p7final.c
 ./a.out
Enter a number
2
Enter the element no 0 of the array
4
Enter the element no 1 of the array
5
The sum of4 + 5 = 9
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x90c: file p7final.c, line 37.
(gdb) r
Starting program: /home/runner/pps-test1-GRajeshwar315-62/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:37
37  {
(gdb) n
39    n=input();
(gdb) n
Enter a number
 
 gcc -g p7final.c
 ./a.out
Enter a number
3
Enter the element no 0 of the array
5
Enter the element no 1 of the array
7
Enter the element no 2 of the array
6
The sum of5 + 7 + 6 = 18
 gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x90c: file p7final.c, line 37.
(gdb) r
Starting program: /home/runner/pps-test1-GRajeshwar315-62/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p7final.c:37
37  {
(gdb) n
39    n=input();
(gdb) n
Enter a number
6
40    int a[n];
(gdb) n
41    input_array(n,a);
(gdb) n
Enter the element no 0 of the array
n
Enter the element no 1 of the array
Enter the element no 2 of the array
Enter the element no 3 of the array
Enter the element no 4 of the array
Enter the element no 5 of the array
42    sum=array_sum(n,a);
(gdb) n
43    output(n,a,sum);
(gdb) n
The sum of0 + 6 + 1166070528 + 673808710 + -1490728496 + 32764 = 349183512
44  }
(gdb) s
__libc_start_main (main=0x55ea5ae008fb <main>, argc=1, argv=0x7ffca7254ab8, 
    init=<optimized out>, fini=<optimized out>, rtld_fini=<optimized out>, 
    stack_end=0x7ffca7254aa8) at ../csu/libc-start.c:344
344 ../csu/libc-start.c: No such file or directory.
(gdb) p
The history is empty.
(gdb) c
Continuing.
[Inferior 1 (process 616) exited normally]
(gdb) l
339 in ../csu/libc-start.c
(gdb) 